app/controllers/authors_controller.rb

  def create
    @author = Author.new(author_params)
    if @author.save
---
INSERT INTO `authors` (`first_name`, `last_name`, `created_at`, `updated_at`) VALUES ('Rooham', 'Mossalli', '2016-04-14 07:53:25', '2016-04-14 07:53:25')