app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    @book.save
---
INSERT INTO `books` (`title`, `category_id`, `author_id`, `publisher_id`, `isbn`, `buy`, `format`, `excerpt`, `pages`, `year`, `coverpath`, `created_at`, `updated_at`) VALUES ('Android', 3, 3, 1, '33324242', 'http://php.net/manual/en/language.operators.logical.php', 'page back', 'this is Text', 234, '2015', 'covers/android4.jpg', '2016-04-14 10:06:16', '2016-04-14 10:06:16')