app/controllers/publishers_controller.rb

  def create
    @publisher = Publisher.new(publisher_params)
    if @publisher.save
---
INSERT INTO `publishers` (`name`, `created_at`, `updated_at`) VALUES ('Persian Book', '2016-04-14 08:41:00', '2016-04-14 08:41:00')